OpenFOAM/gasThermoCoupled-OFv1812/cases/laminar/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-7.5 0 0)               //0
    (-7 0 0)                 //1
    (-3.5 0 0)               //2
    (0 0 0)                  //3
    (-7.5 0.75 -0.032745707) //4
    (-7 0.75 -0.032745707)   //5
    (-3.5 2 -0.087321886)    //6
    (0 2 -0.087321886)       //7
    (-7.5 2.5 -0.10915236)   //8
    (-7 2.5 -0.10915236)     //9
    (-3.5 2.5 -0.10915236)   //10
    (0 2.5 -0.10915236)      //11
    (-7.5 0.75 0.032745707)  //12
    (-7 0.75 0.032745707)    //13
    (-3.5 2 0.087321886)     //14
    (0 2 0.087321886)        //15
    (-7.5 2.5 0.10915236)    //16
    (-7 2.5 0.10915236)      //17
    (-3.5 2.5 0.10915236)    //18
    (0 2.5 0.10915236)       //19
);

blocks
(
    hex (0 1 5 4 0 1 13 12) (15 15 1) simpleGrading (1 1 1)
    hex (2 3 7 6 2 3 15 14) (20 20 1) simpleGrading (2 0.25 1)
    hex (4 5 9 8 12 13 17 16) (15 15 1) simpleGrading (1 1 1)
    hex (5 6 10 9 13 14 18 17) (50 15 1) simpleGrading (1 1 1)
    hex (6 7 11 10 14 15 19 18) (20 15 1) simpleGrading (2 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (1 5 13 1)
            (5 6 14 13)
            (2 2 14 6)
        );
    }
    farFieldMoving
    {
        type patch;
        faces
        (
            (9 17 18 10)
        );
    }
    fixedWall
    {
        type wall;
        faces
        (
            (3 7 15 3)
            (7 11 19 15)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
            (2 3 3 2)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 0 12 4)
            (4 12 16 8)
        );
    }
    farField
    {
        type patch;
        faces
        (
            (8 16 17 9)
            (10 18 19 11)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 4 5 1)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
            (12 13 17 16)
            (13 14 18 17)
            (14 15 19 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
